{
	"version": "https://jsonfeed.org/version/1",
	"title": "It’s the Little Things",
	"icon": "https://micro.blog/littleknown/avatar.jpg",
	"home_page_url": "https://blog.scottjlittle.net/",
	"feed_url": "https://blog.scottjlittle.net/feed.json",
	"items": [
		
			{
				"id": "http://littleknown.micro.blog/2023/03/06/finished-reading-velocity.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780316419604\">Velocity Weapon</a> by Megan E. O&rsquo;Keefe 📚I loved this story, it was a great adventure, with some really interesting twists that make you think about things. I have actually already started the second book in the series and it is also a lot of fun.</p>\n",
				"content_text": "Finished reading: [Velocity Weapon](https://micro.blog/books/9780316419604) by Megan E. O'Keefe 📚I loved this story, it was a great adventure, with some really interesting twists that make you think about things. I have actually already started the second book in the series and it is also a lot of fun.\n",
				"date_published": "2023-03-06T09:56:40+01:00",
				"url": "https://blog.scottjlittle.net/2023/03/06/finished-reading-velocity.html",
				"tags": ["Book"]
			},
			{
				"id": "http://littleknown.micro.blog/2023/02/13/dream-theater-warszawa.html",
				"title": "Dream Theater 🎵 (29.01.2023 Warszawa)",
				"content_html": "<h3 id=\"dream-theater\">Dream Theater</h3>\n<p><strong>Concert Date:</strong> <em>29 January 2023</em>\n<!-- raw HTML omitted -->\n<strong>Location:</strong> <em>Torwar, Warszawa</em></p>\n<!-- raw HTML omitted -->\n<p>Since I was already in Warszawa for the weekend, I decided to go see the <strong>Dream Theater</strong> concert that would take place. It has been many years since I have seen them live and I haven&rsquo;t even paid much attention to their newest albums (<em>Dream Theater</em>, <em>Distance Over Time</em>, &amp; <em>A View From the Top of the World</em>), so I wasn&rsquo;t exactly sure what to expect. I have been a big fan before and even liked some of the music after Mike Portnoy left the band, but my interest has waned, even if I still enjoy the older stuff sometimes.</p>\n<p>As usual, the musicians of <strong>Dream Theater</strong> are technically impressive when they play and this concert was no different. <strong>John Myung</strong> is always just an incredible bassist to watch. His fluidity with his instrument is mesmerizing and I love to watch him play. For me <strong>Dream Theater</strong> has always been a double-edged sword – they are generally classified as <em>Prog Metal</em>, which is very apt and they could even credited with establishing that genre. There is metal music that I enjoy, but it is not why I come to music. I came to <strong>Dream Theater</strong> because of the prog esthetics <em>way</em> more than for any other reason.</p>\n<p>This concert just reinforced for me why I have drifted away. This was a <em><strong>metal</strong></em> concert, through and through. The guest band, <strong>Arion</strong>, of whom I had never heard before, were straight up metal. Completely not my thing. And <strong>Dream Theater</strong> continued that trend in their part of the show. The two choices from early albums were <em>Pull Me Under</em> and <em>6:00</em>, which are both very heavy and never my favorites. The section that I enjoyed the most was the three last songs from <em>Six Degrees of Inner Turbulence</em>, which was fantastic!</p>\n<p>Of course, they played a lot from their latest album <em>View From the Top of the World</em>, including the 20 min title piece, which was was interesting, but ultimately not my thing. This will probably be the last time that I see them, though I am glad that I went to see where they are at right now and where they are going. If you are into the more metal side of things, then I can definitely still recommend going to see this genre-defining group.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "### Dream Theater\n\n**Concert Date:** _29 January 2023_\n<br/>\n**Location:** _Torwar, Warszawa_\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/1cdcdd3d9c.jpg\" alt=\"Dream Theater on stage\" title=\"IMG_3292.jpeg\" border=\"0\" width=\"502\" height=\"300\" />\n\nSince I was already in Warszawa for the weekend, I decided to go see the **Dream Theater** concert that would take place. It has been many years since I have seen them live and I haven't even paid much attention to their newest albums (_Dream Theater_, _Distance Over Time_, & _A View From the Top of the World_), so I wasn't exactly sure what to expect. I have been a big fan before and even liked some of the music after Mike Portnoy left the band, but my interest has waned, even if I still enjoy the older stuff sometimes.\n\nAs usual, the musicians of **Dream Theater** are technically impressive when they play and this concert was no different. **John Myung** is always just an incredible bassist to watch. His fluidity with his instrument is mesmerizing and I love to watch him play. For me **Dream Theater** has always been a double-edged sword – they are generally classified as _Prog Metal_, which is very apt and they could even credited with establishing that genre. There is metal music that I enjoy, but it is not why I come to music. I came to **Dream Theater** because of the prog esthetics _way_ more than for any other reason.\n\nThis concert just reinforced for me why I have drifted away. This was a _**metal**_ concert, through and through. The guest band, **Arion**, of whom I had never heard before, were straight up metal. Completely not my thing. And **Dream Theater** continued that trend in their part of the show. The two choices from early albums were _Pull Me Under_ and _6:00_, which are both very heavy and never my favorites. The section that I enjoyed the most was the three last songs from _Six Degrees of Inner Turbulence_, which was fantastic!\n\nOf course, they played a lot from their latest album _View From the Top of the World_, including the 20 min title piece, which was was interesting, but ultimately not my thing. This will probably be the last time that I see them, though I am glad that I went to see where they are at right now and where they are going. If you are into the more metal side of things, then I can definitely still recommend going to see this genre-defining group.\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/1297a352f5.jpg\" alt=\"Dream Theater playing Pull Me Under\" title=\"IMG_3299.jpeg\" border=\"0\" width=\"501\" height=\"300\" />\n",
				"date_published": "2023-02-13T10:11:06+01:00",
				"url": "https://blog.scottjlittle.net/2023/02/13/dream-theater-warszawa.html",
				"tags": ["Concert","Music"]
			},
			{
				"id": "http://littleknown.micro.blog/2023/01/30/finished-reading-less.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9781473581739\">Less is More: How Degrowth Will Save the World</a> by Jason Hickel 📚</p>\n<p>This book is fascinating in the way in breaks down the history of systemic/exploitative capitalism, how it came about 500 years ago, what the problems are with it and how to move beyond the problems that the current economic system has inflicted upon us.</p>\n<p>I think for a lot of people this book may be hard to take because it really does go against the entire structure of our current global economy, but it is <strong>not</strong> a socialist manifesto or anything like that. In fact, it clearly shows that what would really be an <em>exchange-of-value</em> based economy is very different from what we currently have.</p>\n<p>I would recommend it for anyone, but especially if you are at all concerned about the future of our environment and the inherent social/economic inequality in the world right now.</p>\n",
				"content_text": "Finished reading: [Less is More: How Degrowth Will Save the World](https://micro.blog/books/9781473581739) by Jason Hickel 📚\r\n\r\nThis book is fascinating in the way in breaks down the history of systemic/exploitative capitalism, how it came about 500 years ago, what the problems are with it and how to move beyond the problems that the current economic system has inflicted upon us.\r\n\r\nI think for a lot of people this book may be hard to take because it really does go against the entire structure of our current global economy, but it is **not** a socialist manifesto or anything like that. In fact, it clearly shows that what would really be an _exchange-of-value_ based economy is very different from what we currently have.\r\n\r\nI would recommend it for anyone, but especially if you are at all concerned about the future of our environment and the inherent social/economic inequality in the world right now.\n",
				"date_published": "2023-01-30T11:02:46+01:00",
				"url": "https://blog.scottjlittle.net/2023/01/30/finished-reading-less.html",
				"tags": ["Book"]
			},
			{
				"id": "http://littleknown.micro.blog/2023/01/29/distant-dream-warszawa.html",
				"title": "Distant Dream 🎵 (28.01.2023 Warszawa)",
				"content_html": "<h3 id=\"distant-dream\">Distant Dream</h3>\n<p><strong>Concert Date:</strong> <em>28 January 2023</em>\n<!-- raw HTML omitted -->\n<strong>Location:</strong> <em>Klub Potok, Warszawa</em></p>\n<!-- raw HTML omitted -->\n<p>After our hiking <a href=\"https://blog.scottjlittle.net/2023/01/29/hiking-in-the.html\">trip in the mountains</a>, I stopped on the way from Kraków to Gdańsk in Warszawa to see a couple of concerts and cheer on my fellow teammates in a Warszawa Liga Ultimate competition. On the Saturday night I went to see a band I had learned about in the last 6 months called <a href=\"https://distantdream.bandcamp.com\"><strong>Distant Dream</strong></a>. They are actually from Gdańsk, though I have not yet seen or heard of any shows in the <em>trojmiasto</em>. Maybe in the near future. They play <em>post-rock/post-metal</em> as a genre, focused mostly on hard riffing guitars rather than using any keyboards.</p>\n<p>Before I talk more about them, though there were 2 groups that played before them: <a href=\"https://walkamongstatues.bandcamp.com\"><strong>Walk Among Statues</strong></a> first and then <a href=\"https://metafox.bandcamp.com\"><strong>Metafox</strong></a>. All three bands are Polish, with <strong>Walk Among Statues</strong> being from Wrocław and <strong>Metafox</strong> from Siedlce.</p>\n<p><strong>Walk Among Statues</strong> were enjoyable live and enjoyed the bass playing quite a bit. The music was good without standing out for the <em>post-rock</em> genre. One thing that I found interesting about them is that they never really stopped between pieces. Maybe this is because they had a short amount of time and just tried to play through. Nothing at all problematic or unpleasant about it, but I thought it was interesting to note.</p>\n<!-- raw HTML omitted -->\n<p>I had not know of <strong>Metafox</strong> before this concert, but I had taken the time to listen to their <em>Immobilize</em> album before the concert and found that I really enjoyed the diversity of the sounds that they put into the music. Although they were enjoyable on the stage and the bass player was obviously having a lit of fun dancing around in his socks, I didn&rsquo;t quite feel the diversity of sound that I did on the album. For instance, the lead guitarist did a lot of touch tapping, but you could only occasionally hear it well. Not a great disappointment, but too bad in any case. These guys had some great technical skill and reflected that it the instrument choices, both guitarists used 8 string guitars for their main axes and the bass guitar was a six string headless beast.</p>\n<p>This band played to music that was the most listenable on stage for the evening, despite not being as diverse sounding as I hoped they would be. I would definitely see them again live.</p>\n<!-- raw HTML omitted -->\n<p>I discovered <strong>Distant Dream</strong> via recommendations in Apple&rsquo;s Music app when I was listening to a bit of <strong>Tides From Nebula</strong>. Although they play in the same genre of music, they definitely do not have the same approach. As I mentioned, they rely heavily upon the guitars and creating a <strong>large</strong> wall of sound, using mostly the drums and bass to create some rhythm. Very head-bangy when live.</p>\n<p>I love to listen to their studio albums and will keep doing so, but we&rsquo;ll see if I decide to go see them live again. But they do put on a great show and had a nice clean distraction-free stage, giving them space to move around freely and interact amonst each other.</p>\n",
				"content_text": "### Distant Dream\n\n**Concert Date:** _28 January 2023_\n<br/>\n**Location:** _Klub Potok, Warszawa_\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/fd4be46e60.jpg\" alt=\"Distant Dream on stage\" title=\"IMG_3284.jpeg\" border=\"0\" width=\"552\" height=\"325\" />\n\nAfter our hiking [trip in the mountains](https://blog.scottjlittle.net/2023/01/29/hiking-in-the.html), I stopped on the way from Kraków to Gdańsk in Warszawa to see a couple of concerts and cheer on my fellow teammates in a Warszawa Liga Ultimate competition. On the Saturday night I went to see a band I had learned about in the last 6 months called [**Distant Dream**](https://distantdream.bandcamp.com). They are actually from Gdańsk, though I have not yet seen or heard of any shows in the _trojmiasto_. Maybe in the near future. They play _post-rock/post-metal_ as a genre, focused mostly on hard riffing guitars rather than using any keyboards.\n\nBefore I talk more about them, though there were 2 groups that played before them: [**Walk Among Statues**](https://walkamongstatues.bandcamp.com) first and then [**Metafox**](https://metafox.bandcamp.com). All three bands are Polish, with **Walk Among Statues** being from Wrocław and **Metafox** from Siedlce.\n\n**Walk Among Statues** were enjoyable live and enjoyed the bass playing quite a bit. The music was good without standing out for the _post-rock_ genre. One thing that I found interesting about them is that they never really stopped between pieces. Maybe this is because they had a short amount of time and just tried to play through. Nothing at all problematic or unpleasant about it, but I thought it was interesting to note.\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/e27dabf236.jpg\" alt=\"Walk Among Statutes\" title=\"IMG_3269.jpeg\" border=\"0\" width=\"548\" height=\"300\" />\n\nI had not know of **Metafox** before this concert, but I had taken the time to listen to their _Immobilize_ album before the concert and found that I really enjoyed the diversity of the sounds that they put into the music. Although they were enjoyable on the stage and the bass player was obviously having a lit of fun dancing around in his socks, I didn't quite feel the diversity of sound that I did on the album. For instance, the lead guitarist did a lot of touch tapping, but you could only occasionally hear it well. Not a great disappointment, but too bad in any case. These guys had some great technical skill and reflected that it the instrument choices, both guitarists used 8 string guitars for their main axes and the bass guitar was a six string headless beast.\n\nThis band played to music that was the most listenable on stage for the evening, despite not being as diverse sounding as I hoped they would be. I would definitely see them again live.\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/96d2abe216.jpg\" alt=\"Metafox on stage\" title=\"IMG_3274.jpeg\" border=\"0\" width=\"580\" height=\"300\" />\n\nI discovered **Distant Dream** via recommendations in Apple's Music app when I was listening to a bit of **Tides From Nebula**. Although they play in the same genre of music, they definitely do not have the same approach. As I mentioned, they rely heavily upon the guitars and creating a **large** wall of sound, using mostly the drums and bass to create some rhythm. Very head-bangy when live.\n\nI love to listen to their studio albums and will keep doing so, but we'll see if I decide to go see them live again. But they do put on a great show and had a nice clean distraction-free stage, giving them space to move around freely and interact amonst each other.\n",
				"date_published": "2023-01-29T17:59:30+01:00",
				"url": "https://blog.scottjlittle.net/2023/01/29/distant-dream-warszawa.html",
				"tags": ["Concert","Music"]
			},
			{
				"id": "http://littleknown.micro.blog/2023/01/29/hiking-in-the.html",
				"title": "Hiking in the Beskidy",
				"content_html": "<!-- raw HTML omitted -->\n<h2 id=\"day-one--jan-23\">Day One – Jan 23</h2>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<h2 id=\"day-two--jan-24\">Day Two – Jan 24</h2>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<h2 id=\"day-three--jan-25\">Day Three – Jan 25</h2>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>However, as we approached the top of the hill, the fog cleared around us and we could see blue sky through the trees and the their tops covered in crystals were all brilliantly lit by the sun in white. It was <em>fantastic</em>. Then we came out of the forest to a clearing on the top and had a short little view – which we had been missing the entire way. It was well worth the climb, even to the kids. There we found the shelter, <strong>Hala Kropowa</strong>, sitting just a bit down the other side of the crest.</p>\n<!-- raw HTML omitted -->\n<p>We settled into the shelter, had lunch and took in the view from where we were, now that the clouds had mostly cleared off on the horizon. We had another wonderful surprise being able to see a mountain range off in the distance. It was probably the rest of the <strong>Beskids</strong>, but it could have been the <strong>Tatras</strong> as well.</p>\n<!-- raw HTML omitted -->\n<p>We seemed to be alone in the shelter for the night and we stayed up a little late playing <a href=\"https://www.playmonster.com/wp-content/uploads/2018/06/Farkle-Rules.pdf\">Farkle (PDF)</a> with the kids, after a good Polish dinner along with a hot wine/beer or two. A nice finish to the day.</p>\n<h2 id=\"day-four--jan-26\">Day Four – Jan 26</h2>\n<p>The last day was supposed to be a day that wasn&rsquo;t too hard, even if it was long. We had 12kms to get from the shelter to the train station at <strong>Juszczyn</strong>, where we would take a train to <strong>Zembrzyce</strong> where we had a reservation in a little cabin. Most of that last day was downhill, but there were a couple of points where we had to go up and I know I certainly felt it. I was tired by this point. So were the kids.</p>\n<!-- raw HTML omitted -->\n<p>Of course, the saving grace of the day was the incredible landscapes around us and the show on the trees. I enjoyed it immensely. We came to one little passage, where we had to go through a very narrow part, that felt like something from either a fairy tale or from <em>The Shining</em>!</p>\n<!-- raw HTML omitted -->\n<p>The very last part before coming out in <strong>Juszczyn</strong> was quite steep going down and was in a little gully, that certainly looked like it would be a riverbed in springtime. It was very difficult from the view point of my knees 😖. Boy was I happy when that flattened out and we were done with that part!</p>\n<p>In summary, it was a very difficult trip and, as I told my wife, there actually were quite a few points (and maybe even overall) that I was not enjoying myself. But we had a plethora of beautiful sights, there were many moments where we were all having a good time together and we certainly pushed ourselves over the 4 days. My watched recorded (with extra walking parts here and there) 60km over the 4 days. That is quite a bit! My wife has started thinking about a trip at easter. We&rsquo;ll see Chérie!</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "\n<p>In Gdańsk, the two weeks from Jan 16 - Jan 29 are school vacation. My son went skiing in the the southern mountains for the first week and so for the second week we came down from Gdańsk to Kraków to meet him and do a little bit of hiking as a family in the mountains around the area where he skied called the <strong>Beskidy</strong> (Beskids?).</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_3128.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/a09502b2a5.jpg\" alt=\"Family among the snowy trees - day one\" width=\"597\" height=\"178\" border=\"0\" /></p>\n\n## Day One – Jan 23\n\n<p>From <strong>Kraków</strong> we took a train to <strong>Maków Podhalański</strong> on Monday morning, did a little shopping to have some fruits and trail mix to snack on during the hike and started the first day of our hiking. Our goal for the first day was a 10 km trail taking us from <strong>Maków Podhalański</strong> to <strong>Sucha Beskidzka</strong>. Each of our nights were planned to stay in a home or shelter. For the first night my wife had found a really nice house right near <strong>Sucha Beskidzka</strong>, that we were looking forward to and were even thinking that it was too bad to have on the first night.</p>\n\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_3135.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/0ff4105154.jpg\" alt=\"Among the snowy trees\" width=\"300\" height=\"400\" border=\"0\" /></p>\n\n<p>It turns out however, that it was really nice to have at the end of the first day. There was a bit of uphill and with our packs it was difficult and the kids had difficulty at various points along the way being motivated to keep going. But the forest was very beautiful, with snow covering all of the trees during the whole of the trail. There had been good snowfall the week before, even if there was less snow than usual. We had about 25–30 cm on the ground during this portion of the trail.</p>\n\n<p>The little house that we rented was quite welcome in the end. A small wood stove with a warm fire welcomed us and my wife and kids went to the store down the road to get the required things to make a quinoto for dinner. While they were away I listened to the new Riverside album (ID.Entity) and watched the fire, while also stretching my old muscles. After playing five matches in an ultimate tournament the day before, I was especially tired and fatigued.</p>\n\n## Day Two – Jan 24\n\n<p>The second day my wife and I had planned a rather ambitious 13 km hike with a stop at a <em>karczma</em> (traditional countryside restaurant) about midway through the hike. From the nice house in <strong>Sucha Beskidzka</strong> we were headed to a little place in <strong>Zawoja</strong>. Each morning of our hike started out challenging for my son. He really had a hard time getting going, especially since each day started with an uphill part, so there was an extra level of effort for him. After a while though he got his stride and we were enjoying the hike and a few stops to admire the gorgeous landscape and the trees. Then as we continued to head uphill, my daughter started to falter, taking stops every 15 meters it seemed. It was a hard day and was quite a lot of uphill.</p>\n\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_3161.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/22f87b45ac.jpg\" alt=\"Foggy &amp; Snowy Trees\" width=\"533\" height=\"400\" border=\"0\" /></p>\n\n<p>Finally though we made it to where the <em>karczma</em> was, after 9 km of hiking – which was a little more than we had actually planned. However, it turns out that the <em>karczma</em> was only open for big events and was part of a 3 star hotel &amp; spa in the countryside. So we had lunch and thought about how to continue, since we actually still had another 7km to do before we would arrive in <strong>Zawoja</strong>. After some consideration of our options (it was very difficult to get a taxi in the area), we ended up staying in the <strong>Beskidzki Raj Hotel</strong>. The kids loved this, since they were exhausted and didn’t really want to get back on the trail.</p>\n\n<p>Unfortunately my daughter had been feeling a little uncomfortable in her stomach during the trip and didn’t really feel like eating much (which is <strong>very</strong> unusual for her). But me and the kids still went to the pool and jacuzzi to relax a little bit, then my wife and son took advantage of the pool table and ping pong to play a bit. We were a little nervous about my daughter and how she would feel the next morning. Also we had to adjust our plans to skip <strong>Zawoja</strong> and find a way in the morning to cut off some kms.</p>\n\n##  Day Three – Jan 25\n\n<p>In the end, she was feeling a bit better in the morning and we found a taxi to take us to <strong>Skawica</strong> where we could start our day on the way to the <strong>Hala Kropowa Shelter</strong> up in the mountains. This was another 9km hike and almost all of it was uphill. We knew that we could do it, but to be honest it was still a test of motivation to get going and impel ourselves up the hill.</p>\n\n<p style=\"text-align: center;\">\n\t<img style=\"display: inline; margin-left: 50px;\" title=\"IMG_3164.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/865da36735.jpg\" alt=\"Starting the 3rd day\" width=\"225\" height=\"300\" border=\"0\" />\n\t<img style=\"display: inline; margin-right: 50px;\" title=\"IMG_3189.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/c77cb4c0eb.jpg\" alt=\"Kids in the tress\" width=\"225\" height=\"300\" border=\"0\" />\n</p>\n\n<p>It was another day of almost all uphill from the start. But the trees around us were spectacular to look at despite having no sunlight. This was the case during all of our trip – every day was cloudy and overcast, but at least it wasn’t too cold. The temperature was always around 0°C. There was a bit of soft ground and water melt, but it was mostly underneath the snow and ass long as we were careful where we walked wasn’t really a problem.</p>\n\n<p>There was a lot of work on this day motivating the kids to keep going up the hills to get to the shelter where we would spend the night up in the mountains. We did a lot of stops on the way up the 9km in the fog. We had many times when we could not see more than about 200 meters in any direction. The cold with the fog was very interesting in that it had built up ice crystals on all of the trees around us. The crystals were just beautiful all around us. I had a hard time not stopping constantly to take pictures 😜. Between the kids taking breaks and me pausing for photo ops, we took a little while to get up those 9kms.</p>\n\n<p style=\"text-align: center;\">\n\t<img style=\"\" title=\"IMG_3186.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/d9fc9895a5.jpg\" alt=\"Ice crystals on branches.\" width=\"300\" height=\"225\" border=\"0\" />\n\t<img style=\"\" title=\"IMG_3198.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2023/960b6e55d0.jpg\" alt=\"Ice crystals on moss and tree stump\" width=\"300\" height=\"225\" border=\"0\" />\n</p>\n\nHowever, as we approached the top of the hill, the fog cleared around us and we could see blue sky through the trees and the their tops covered in crystals were all brilliantly lit by the sun in white. It was _fantastic_. Then we came out of the forest to a clearing on the top and had a short little view – which we had been missing the entire way. It was well worth the climb, even to the kids. There we found the shelter, **Hala Kropowa**, sitting just a bit down the other side of the crest.\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/a396f3cee8.jpg\" alt=\"Brightly lit tree tops\" title=\"IMG_3201.jpeg\" border=\"0\" width=\"600\" height=\"197\" />\n<br/>\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/5e3838d14b.jpg\" alt=\"At the top\" title=\"IMG_3227.jpeg\" border=\"0\" width=\"600\" height=\"140\" />\n\nWe settled into the shelter, had lunch and took in the view from where we were, now that the clouds had mostly cleared off on the horizon. We had another wonderful surprise being able to see a mountain range off in the distance. It was probably the rest of the **Beskids**, but it could have been the **Tatras** as well.\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/cada16bfd2.jpg\" alt=\"Mountin range view above clouds\" title=\"IMG_3233.jpeg\" border=\"0\" width=\"400\" height=\"282\" />\n\nWe seemed to be alone in the shelter for the night and we stayed up a little late playing [Farkle (PDF)](https://www.playmonster.com/wp-content/uploads/2018/06/Farkle-Rules.pdf) with the kids, after a good Polish dinner along with a hot wine/beer or two. A nice finish to the day.\n\n## Day Four – Jan 26\n\nThe last day was supposed to be a day that wasn't too hard, even if it was long. We had 12kms to get from the shelter to the train station at **Juszczyn**, where we would take a train to **Zembrzyce** where we had a reservation in a little cabin. Most of that last day was downhill, but there were a couple of points where we had to go up and I know I certainly felt it. I was tired by this point. So were the kids.\n\n<p style=\"text-align: center;\">\n\t<img style=\"\" src=\"https://blog.scottjlittle.net/uploads/2023/c985bb5555.jpg\" alt=\"Lying down on the hike\" title=\"IMG_3256.jpeg\" border=\"0\" width=\"300\" height=\"400\" />\n\t<img style=\"\" src=\"https://blog.scottjlittle.net/uploads/2023/4270ca1ee9.jpg\" alt=\"Break time again!\" title=\"IMG_3261.jpeg\" border=\"0\" width=\"300\" height=\"400\" />\n</p>\n\nOf course, the saving grace of the day was the incredible landscapes around us and the show on the trees. I enjoyed it immensely. We came to one little passage, where we had to go through a very narrow part, that felt like something from either a fairy tale or from _The Shining_!\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/2cfa5ec299.jpg\" alt=\"Snow labyrinth!\" title=\"IMG_3264.jpeg\" border=\"0\" width=\"300\" height=\"400\" />\n\nThe very last part before coming out in **Juszczyn** was quite steep going down and was in a little gully, that certainly looked like it would be a riverbed in springtime. It was very difficult from the view point of my knees 😖. Boy was I happy when that flattened out and we were done with that part!\n\nIn summary, it was a very difficult trip and, as I told my wife, there actually were quite a few points (and maybe even overall) that I was not enjoying myself. But we had a plethora of beautiful sights, there were many moments where we were all having a good time together and we certainly pushed ourselves over the 4 days. My watched recorded (with extra walking parts here and there) 60km over the 4 days. That is quite a bit! My wife has started thinking about a trip at easter. We'll see Chérie!\n\n<img style=\"display:block; margin-left:auto; margin-right:auto;\" src=\"https://blog.scottjlittle.net/uploads/2023/065a9d70ac.jpg\" alt=\"Four backpacks at the last bus stop\" title=\"IMG_3266.jpeg\" border=\"0\" width=\"600\" height=\"450\" />\n",
				"date_published": "2023-01-29T17:09:42+01:00",
				"url": "https://blog.scottjlittle.net/2023/01/29/hiking-in-the.html",
				"tags": ["Family","Travel"]
			},
			{
				"id": "http://littleknown.micro.blog/2023/01/01/years-ago-last.html",
				
				"content_html": "<p>20 years ago last night, I met my better half. It has been a great adventure with her! I wish everyone such luck and love.\n<img src=\"https://cdn.uploads.micro.blog/611/2023/7619f6e242.jpg\" alt=\"BA012D5E-A468-47B7-B4E1-E69966BCD7CD.jpg\"></p>\n",
				"content_text": "  20 years ago last night, I met my better half. It has been a great adventure with her! I wish everyone such luck and love.\n![BA012D5E-A468-47B7-B4E1-E69966BCD7CD.jpg](https://cdn.uploads.micro.blog/611/2023/7619f6e242.jpg)\n",
				"date_published": "2023-01-01T14:45:07+01:00",
				"url": "https://blog.scottjlittle.net/2023/01/01/years-ago-last.html"
			},
			{
				"id": "http://littleknown.micro.blog/2023/01/01/finished-reading-grace.html",
				
				"content_html": "<p>Finished reading: <a href=\"https://micro.blog/books/9780358651864\">Grace: President Obama and Ten Days in the Battle for America</a> by Cody Keenan 📚I actually finished this book in mid-November, but I am just posting now. I also have to say that I might be a little biased, since Cody is my cousin, but this book was soooo good.</p>\n<p>I don’t read too much non-fiction usually, since I find it slow reading for me and I get a little impatient. This book was a great story though despite being non-fiction.</p>\n<p>This tells the story of 10 days during the Obama administration with several significant events coming to a head. The story builds will many asides taking us back to significant events in the past that tie into the current story.</p>\n<p>I laughed out loud and cried and chastised my cousin for being too hard on himself! But mostly, I just loved a great telling of meaningful events and people working to make the world.</p>\n",
				"content_text": "Finished reading: [Grace: President Obama and Ten Days in the Battle for America](https://micro.blog/books/9780358651864) by Cody Keenan 📚I actually finished this book in mid-November, but I am just posting now. I also have to say that I might be a little biased, since Cody is my cousin, but this book was soooo good.\n\nI don’t read too much non-fiction usually, since I find it slow reading for me and I get a little impatient. This book was a great story though despite being non-fiction.\n\nThis tells the story of 10 days during the Obama administration with several significant events coming to a head. The story builds will many asides taking us back to significant events in the past that tie into the current story.\n\nI laughed out loud and cried and chastised my cousin for being too hard on himself! But mostly, I just loved a great telling of meaningful events and people working to make the world.\n",
				"date_published": "2023-01-01T14:19:50+01:00",
				"url": "https://blog.scottjlittle.net/2023/01/01/finished-reading-grace.html",
				"tags": ["Book"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/31/riverside-gdynia.html",
				"title": "Riverside 🎵 (2022-09-22 Gdynia)",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<p><strong>Riverside</strong></p>\n<p><strong>Concert Date:</strong> <em>22 September 2022</em><br /><strong>Location:</strong> <em>Gdynia Arena</em></p>\n<p>This was my first time seeing Riverside in an arena environment. Truthfully, though, the Gdynia Arena is not a huge one. I have seen Riverside over 10 times so far in many different environments, including in 3 different countries and one of the things that has always impressed me about their shows is that they absolutely nail the sound every time. whether it is a small klub or an arena.</p>\n<p>The first band to play before Riverside was a group called <a href=\"https://obrasqi.com\">Obrasqi</a>, which I did non know, but was very happy to discover. They list themselves as dreampop on their <a href=\"https://pl.wikipedia.org/wiki/Obrasqi?wprov=sfti1\">Wikipedia page, pl only</a>. I am not familiar with that genre name but I guess it fits their style. it was very etherial and yet had a more complex feel to the music. </p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2519.jpeg\" src=\"https://cdn.uploads.micro.blog/611/2022/0ae94b716d.jpg\" alt=\"IMG 2519\" width=\"400\" height=\"286\" border=\"0\" /></p>\n<p>I am writing this post quite a while after the show (working some older content into the blog), but it is worth it to me to capture the memories as best I can. Unfortunately I learned a few days ago that since then the vocalist drowned in a lake in nearby Kartuzy trying to save her dog who broke through the ice of the lake. A real tragedy. </p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2521.jpeg\" src=\"https://cdn.uploads.micro.blog/611/2022/aca30696f1.jpg\" alt=\"IMG 2521\" width=\"400\" height=\"285\" border=\"0\" /></p>\n<p>Riverside is one of my favorite bands currently producing music. I see them whenever they play near me, which is fortunately fairly often sine I live in Poland. On stage they are a band who is focused on the music, but they have a lot of fun up on stage, expecially lead man Mariusz and keyboardist Michał. These guys are very professional on the stage and thus are very comfortable and that comes across and creates a great atmosphere. Mariusz likes to make lots of jokes while on the stage, and although I don’t quite catch all of them (my Polish is okay, but not that great) it definitely brings the auadience along evenn better. There was great interaction between the audience and the band during the set and they played most of my favorites.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2540.jpeg\" src=\"https://cdn.uploads.micro.blog/611/2022/223ff34701.jpg\" alt=\"IMG 2540\" width=\"598\" height=\"265\" border=\"0\" /></p>\n<p> </p>\n<p>Since the original guitarist, Piotr Grudziński, died one of the most touching songs to hear them do live is “Toward the Blue Horizon”, which sounds like it was written for him, but in truth was written before he passed about another friend of Mariusz’s. Even 7 years later we still fell the emotional impact of that song when played live. But the thing that is really heart-warming is how it is just a part of the music now. Maciej has come in to play the guitar in Piotr’s place, but he is a different guitarist and plays as he feels it and it still works great. I have been a fan of Maciej’s work before he came to Riverside (in Quidam and Meller Golyzniak Duda), so it is great to see this new fusion work so well.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2537.jpeg\" src=\"https://cdn.uploads.micro.blog/611/2022/096d3811d5.jpg\" alt=\"IMG 2537\" width=\"599\" height=\"304\" border=\"0\" /></p>\n<p>I guess that I haven’t said too much directly about the show itself, but truth is that I don’t remember details well (in general) and this is one of the reasons why I wanted to start writing about shows I see. For my own rememberence later on. I very much do remeber the feelings and the pleasure I have at these shows, but the song list as such is never something I have had a good memory for. I am happy that I was there and look forward to seeing them again in 2023, when they play again for the <a href=\"https://riversideband.pl/en/gigs\">ID.Entity tour</a>.</p>\n",
				"date_published": "2022-12-31T15:05:22+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/31/riverside-gdynia.html",
				"tags": ["Concert","Music"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/29/i-have-always.html",
				
				"content_html": "<p>I have always enjoyed an Old Fashion or a Sazarac, but today is the first time I made one myself\n<img src=\"https://cdn.uploads.micro.blog/611/2022/ddba7cc2a8.jpg\" alt=\"CD0E2963-7CD9-44D1-B780-498B75D49EA4.jpg\"></p>\n",
				"content_text": "I have always enjoyed an Old Fashion or a Sazarac, but today is the first time I made one myself \n![CD0E2963-7CD9-44D1-B780-498B75D49EA4.jpg](https://cdn.uploads.micro.blog/611/2022/ddba7cc2a8.jpg)\n",
				"date_published": "2022-12-29T19:26:51+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/29/i-have-always.html"
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/25/happy-whatever-you.html",
				
				"content_html": "<p>Happy whatever you celebrate (or not). We had a great Christmas Eve and my wife made an awesome bûch de noël.\n<img src=\"https://cdn.uploads.micro.blog/611/2022/98913ee32e.jpg\" alt=\"3D09221F-CB12-4CAC-A9D4-3BC3D7220CC6.jpg\">\n<img src=\"https://cdn.uploads.micro.blog/611/2022/51182fdc01.jpg\" alt=\"9E72A2A4-82A0-408B-8BF4-0D35A09C62C5.jpg\"></p>\n",
				"content_text": "Happy whatever you celebrate (or not). We had a great Christmas Eve and my wife made an awesome bûch de noël. \n![3D09221F-CB12-4CAC-A9D4-3BC3D7220CC6.jpg](https://cdn.uploads.micro.blog/611/2022/98913ee32e.jpg)\n![9E72A2A4-82A0-408B-8BF4-0D35A09C62C5.jpg](https://cdn.uploads.micro.blog/611/2022/51182fdc01.jpg)\n",
				"date_published": "2022-12-25T10:49:14+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/25/happy-whatever-you.html"
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/17/since-jean-mentioned.html",
				
				"content_html": "<p>Since <a href=\"https://micro.blog/jean\">@jean</a> mentioned that there weren’t enough dog photos here is my 🐕 Laika chewing her toy</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Since [@jean](https://micro.blog/jean) mentioned that there weren’t enough dog photos here is my 🐕 Laika chewing her toy\n\n<img src=\"https://cdn.uploads.micro.blog/611/2022/833914f824.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2022-12-17T01:51:16+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/17/since-jean-mentioned.html",
				"tags": ["Dog"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/17/well-i-thought.html",
				
				"content_html": "<p>We’ll I thought it was time to go to bed, not sure I can though 🐕</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "We’ll I thought it was time to go to bed, not sure I can though 🐕\n\n<img src=\"uploads/2022/8f40e8106d.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2022-12-17T00:17:57+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/17/well-i-thought.html",
				"tags": ["Dog"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/16/zaz-concert-date.html",
				"title": "Zaz 🎵 (20.10.2022 Sopot)",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<h3>Zaz</h3>\n<p><strong>Concert Date:</strong> <em>22 October 2022</em><br /><strong>Location:</strong> <em>Ergo Arena, Sopot</em></p>\n<p>Zaz is a french pop singer/songwriter who has a special place in french culture, mixing pop sensibilities along with more classical french stylings, such as Edith Piaf. We have had the chance to see her three times here in Poland. She does seem to be popular here. My entire family is a fan of hers. The tickets for this concert were my birthday gift to my wife earlier in the year. We went as a family, as you can see below.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2778.png\" src=\"https://blog.scottjlittle.net/uploads/2022/b33350aee4.png\" alt=\"IMG 2778\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>Zaz is a very personable entertainer and takes time to talk to the audience and chat about the songs that she is going to sing and what they mean to her or how they were written. However, typically, as a french entertainer, she talks to everyone in French. She did ask and the audience was enthusiastic about it and it seemed that most understood what she said. She did take a couple of occasions to speak a pre-written text in Polish, which was also highly appreciated by the audience, if difficult to understand (Polish is really hard to speak for those not familiar with it!)</p>\n<p>Anyway, it was a great show and we enjoyed it very much. She had a great support band who played great music for her to sing to. Several of her more known hits really got the fans singing along (as we did). It is difficult to get Poles to get out of their chairs dancing around, but she did manage. The set of the show was very nicely decorated, with an entire tree up on the stage (which you can see in the image below behind the bassist).</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2772.png\" src=\"https://blog.scottjlittle.net/uploads/2022/341391d086.png\" alt=\"IMG 2772\" width=\"600\" height=\"392\" border=\"0\" /></p>\n<p>Another great concert that we were very happy to attend.</p>\n",
				"date_published": "2022-12-16T11:50:20+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/16/zaz-concert-date.html",
				"tags": ["Concert","Music"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/15/just-finished-reading.html",
				
				"content_html": "<p>Just finished reading: <a href=\"https://micro.blog/books/9781250766380\">The Expert System&rsquo;s Champion (The Expert System&rsquo;s Brother Book 2)</a> by Adrian Tchaikovsky 📚\nThis book and its predecessor <a href=\"https://micro.blog/books/9781250197559\">The Expert System&rsquo;s Brother</a> are great! I love the realistic aspect of how exploration on another planet is dealt with and not ignored as usual in SciFi.</p>\n",
				"content_text": "Just finished reading: [The Expert System's Champion (The Expert System's Brother Book 2)](https://micro.blog/books/9781250766380) by Adrian Tchaikovsky 📚\nThis book and its predecessor [The Expert System's Brother](https://micro.blog/books/9781250197559) are great! I love the realistic aspect of how exploration on another planet is dealt with and not ignored as usual in SciFi. \n",
				"date_published": "2022-12-15T07:28:30+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/15/just-finished-reading.html",
				"tags": ["Book"]
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/15/so-it-looks.html",
				
				"content_html": "<p>So it looks like I am going to start actually posting here on Mb. I have mostly been a lurker on twitter, but I want to change that since I have changed to be here. Content will probably be mostly around activities that I do, concerts, movies and maybe some ultimate frisbee as well.</p>\n",
				"content_text": "So it looks like I am going to start actually posting here on Mb. I have mostly been a lurker on twitter, but I want to change that since I have changed to be here. Content will probably be mostly around activities that I do, concerts, movies and maybe some ultimate frisbee as well. \n",
				"date_published": "2022-12-15T06:23:39+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/15/so-it-looks.html"
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/15/we-like-to.html",
				
				"content_html": "<p>We like to celebrate Christmas in our home, but cutting a tree down is too wasteful. We started doing something like this a few years ago and I really like it.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "We like to celebrate Christmas in our home, but cutting a tree down is too wasteful. We started doing something like this a few years ago and I really like it.\n\n<img src=\"https://cdn.uploads.micro.blog/611/2022/a8409d2701.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-12-15T00:11:07+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/15/we-like-to.html"
			},
			{
				"id": "http://littleknown.micro.blog/2022/12/14/tides-from-nebula.html",
				"title": "Tides From Nebula 🎵 (11.11.2022 Gdansk)",
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<h3>Tides From Nebula</h3>\n<p><strong>Concert Date:</strong> <em>11 November 2022</em><br /><strong>Location:</strong> <em>B90 Klub (in Stocznia), Gdańsk</em></p>\n<p>This is either the 3rd or 4th time that I have seen Tides From Nebula play live. The first time was at the anniversary concert of <a href=\"https:/progresja.com/en\">Klub Progresja</a> in Warsaw probably about 6 or 7 years ago. From the first time that I saw these guys play live I have been mesmerized by the live shows. It was a little harder for me to get into the post-rock genre just listening to the albums, but I eventually found that I really enjoy that as well, but (as with most music, at least for me) the real pleasure is a live show.</p>\n<p>This show had 2 “bands” playing before them. I put that in quotes, because the first was a solo act playing keyboards and trying to sound like a group. He goes by the name Wishlake. The music was pleasant, but had no real interest for me, so I don’t remember muh about it.</p>\n<p>The second group however, <a href=\"https://www.facebook.com/yantra20k/\">Yantra</a> was quite interesting with a mix of progish/post-rock sound, but a good addition that was nice. I wasn’t able to grasp much of the lyrics (in English) at the concert, but the mix of the vocals and the singer’s stage presence were engaging.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2828.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2022/dd42bf753d.jpg\" alt=\"IMG 2828\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>The main show was, of course, Tides From Nebula. Post-rock is a very specific genre and if you don’t enjoy the sound well, there is nothing to say. But these guys are a great mix together, on the drums Tomasz Stołowski, the bass Przemek Węgłowski and on guitar, Maciej Karbowski. Tomasz is very energetic on the drums putting out some great rhythms throughout the set. Both Przymek and Maciej also perform on the keyboards and sample themselves into loops to create the waves of sound that make up the music.</p>\n<p><img style=\"display: block; margin-left: auto; margin-right: auto;\" title=\"IMG_2834.jpeg\" src=\"https://blog.scottjlittle.net/uploads/2022/43bc0f7a76.jpg\" alt=\"IMG 2834\" width=\"600\" height=\"450\" border=\"0\" /></p>\n<p>It was also just a lot of fun to see a band really enjoying being up on the stage and interacting with the audience in a fun and enthusiastic way. They really looked out and smiled and waved at people. In general, I really had a great time listening to these guys play. It really is amusic that creates a double feeling of complexity and yet is danceable.</p>\n",
				"date_published": "2022-12-14T17:29:08+01:00",
				"url": "https://blog.scottjlittle.net/2022/12/14/tides-from-nebula.html",
				"tags": ["Concert","Music"]
			}
	]
}
